#+LaTeX_CLASS: ebook
#+TITLE: More productive with Emacs --- The Ultimate Killer App
#+PROPERTY: header-args :results silent
:NOTES:
- [[http://archive.indianstatistics.org/tools/orgpapers.pdf]]
:END:

** Org Mode Spreadsheet
Org mode also has capabilities to manage small spreadsheets through tables that you can merge with your text. To create a table, just start a line with the | symbol and start entering values. A vertical bar separates each column, and a horizontal line is indicated by starting a line with =|-=.

=| Item    | Price |=
=|---------+-------|=
=| Apples  | 12.00 |=
=| Oranges | 22.00 |=
=|---------|-------|=
=| Total   |       |=

This will at first look messy, but as soon as you enter =Tab= or =C-c C-c=, the table will align itself, saving you the frustration of filling the cells with spaces.

| Item    | Price |
|---------+-------|
| Apples  | 12.00 |
| Oranges | 22.00 |
|---------+-------|
| Total   | :=vsum($2..$3) |
#+TBLFM: @4$2=vsum($2..$3)

The main difference between an Org table with formulas and a spreadsheet is that the formulas are listed in a line below the table and are not automatically updated.

Spreadsheets within org are great for simple applications because it can get unwieldy if you have a lot of formulas.

